tap "eth-p/software", "git@github.com:eth-p/homebrew-software.git"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Platform built on V8 to build network applications
brew "node"
# High precision scientific calculator with support for physical units
brew "insect"
# Implementation of the file(1) command
brew "libmagic"
# Next-gen compiler infrastructure
brew "llvm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Vi 'workalike' with many additional features
brew "vim"
# Debugger for zsh
brew "zshdb"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
cask "appcleaner"
cask "dozer"
cask "firefox"
cask "font-droidsansmono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-meslolg-nerd-font"
cask "google-drive-file-stream"
cask "microsoft-teams"
cask "onedrive"
mas "AdBlock Pro", id: 1018301773
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Trello", id: 1278508951
