tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
brew "bat"
brew "python@3.8"
brew "fd"
brew "git-delta"
brew "insect"
brew "llvm"
brew "lsd"
brew "mas"
brew "pandoc"
brew "poppler"
brew "ripgrep-all"
brew "tesseract"
brew "vim"
brew "xsv"
brew "zshdb"
brew "eth-p/software/bat-extras"
cask "dozer"
cask "font-droidsansmono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-meslolg-nerd-font"
cask "onedrive"
mas "AdBlock Pro", id: 1018301773
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
