# Contains a formula for Apple's San Francisco monospace font
# patched to work with Nerd fonts
tap "epk/epk"
# Needed for SSHFS
tap "gromgit/fuse"
# Contains the "brew bundle" command to generate this file
tap "homebrew/bundle"
# Several graphical applications for macOS
tap "homebrew/cask"
# Several fonts for macOS
tap "homebrew/cask-fonts"
# When you type the name of a command not installed on your machine,
# this will suggest the package you should install to get that command
tap "homebrew/command-not-found"
# The core Homebrew repository that contains all official formulae
tap "homebrew/core"
# "Manage background services with macOS' launchctl daemon manager"
tap "homebrew/services"
# Print a list of paths as a tree of paths
brew "as-tree"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat (see above) with various command-line tools
brew "bat-extras"
# New way to see and navigate directory trees
brew "broot"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Formatter for C, C++, Objective C, Java, JavaScript, and TypeScript
brew "clang-format"
# Convert between \n and \r\n line endings
brew "dos2unix"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# High precision scientific calculator with support for physical units
brew "insect"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# List USB devices
brew "lsusb"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Needed for the "batgrep" command part of the bat-extras package
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Linter for shell scripts
brew "shellcheck"
# Formatter for shell scripts
brew "shfmt"
# SSHFS: mount folders on remote machines as local mounts via SSH
brew "gromgit/fuse/sshfs-mac"
# Application uninstaller
cask "appcleaner"
# Desktop password and login vault
cask "bitwarden"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Web browser
cask "firefox"
# Several nerd fonts for use with lsd
cask "font-droidsansmono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-meslolg-nerd-font"
cask "font-sf-mono-nerd-font"
# Client for the Google Drive storage service
cask "google-drive"
# Graphically shows disk usage within a filesystem
cask "grandperspective"
# JetBrains tools manager
cask "jetbrains-toolbox"
# I think this is needed for SSHFS to work?
cask "macfuse"
# LaTeX for macOS
cask "mactex"
# Cloud storage client
cask "onedrive"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# X11 for macOS: to be able to enable X forwarding when SSH-ing into Linux boxes
cask "xquartz"
# We really do live in a society
cask "zoom"
